; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=138, out_folder=./training, instance_id=6, seed=2030, goal_proportion=0.03

(define (problem blocksworld-06)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 - object)
 (:init 
    (arm-empty)
    (clear b131)
    (on b131 b61)
    (on b61 b89)
    (on b89 b97)
    (on b97 b38)
    (on b38 b36)
    (on b36 b53)
    (on b53 b32)
    (on b32 b126)
    (on b126 b6)
    (on b6 b94)
    (on b94 b122)
    (on-table b122)
    (clear b48)
    (on b48 b17)
    (on-table b17)
    (clear b68)
    (on b68 b135)
    (on-table b135)
    (clear b50)
    (on-table b50)
    (clear b71)
    (on-table b71)
    (clear b10)
    (on b10 b19)
    (on b19 b59)
    (on b59 b123)
    (on b123 b33)
    (on b33 b107)
    (on-table b107)
    (clear b93)
    (on b93 b37)
    (on b37 b52)
    (on b52 b11)
    (on b11 b65)
    (on b65 b136)
    (on b136 b43)
    (on b43 b3)
    (on b3 b56)
    (on b56 b62)
    (on-table b62)
    (clear b109)
    (on b109 b85)
    (on b85 b58)
    (on-table b58)
    (clear b108)
    (on b108 b117)
    (on b117 b92)
    (on-table b92)
    (clear b102)
    (on b102 b88)
    (on-table b88)
    (clear b84)
    (on b84 b47)
    (on-table b47)
    (clear b138)
    (on b138 b72)
    (on b72 b78)
    (on b78 b13)
    (on b13 b87)
    (on b87 b24)
    (on b24 b57)
    (on b57 b95)
    (on-table b95)
    (clear b134)
    (on b134 b2)
    (on b2 b82)
    (on b82 b114)
    (on-table b114)
    (clear b132)
    (on-table b132)
    (clear b40)
    (on b40 b31)
    (on b31 b91)
    (on b91 b54)
    (on-table b54)
    (clear b79)
    (on b79 b4)
    (on b4 b128)
    (on b128 b80)
    (on b80 b103)
    (on-table b103)
    (clear b21)
    (on b21 b83)
    (on-table b83)
    (clear b9)
    (on b9 b7)
    (on b7 b29)
    (on b29 b137)
    (on b137 b81)
    (on b81 b119)
    (on-table b119)
    (clear b22)
    (on b22 b23)
    (on b23 b5)
    (on-table b5)
    (clear b46)
    (on b46 b90)
    (on-table b90)
    (clear b15)
    (on b15 b106)
    (on b106 b26)
    (on b26 b116)
    (on b116 b63)
    (on-table b63)
    (clear b44)
    (on b44 b25)
    (on b25 b18)
    (on b18 b41)
    (on b41 b124)
    (on b124 b104)
    (on b104 b73)
    (on b73 b76)
    (on-table b76)
    (clear b16)
    (on-table b16)
    (clear b42)
    (on b42 b39)
    (on b39 b125)
    (on b125 b130)
    (on b130 b69)
    (on b69 b86)
    (on b86 b101)
    (on b101 b64)
    (on b64 b27)
    (on b27 b14)
    (on b14 b35)
    (on-table b35)
    (clear b51)
    (on b51 b113)
    (on b113 b105)
    (on-table b105)
    (clear b20)
    (on b20 b115)
    (on b115 b111)
    (on b111 b70)
    (on b70 b120)
    (on-table b120)
    (clear b30)
    (on-table b30)
    (clear b45)
    (on-table b45)
    (clear b49)
    (on b49 b110)
    (on b110 b66)
    (on b66 b60)
    (on b60 b28)
    (on-table b28)
    (clear b67)
    (on-table b67)
    (clear b100)
    (on b100 b8)
    (on b8 b55)
    (on b55 b127)
    (on-table b127)
    (clear b75)
    (on b75 b12)
    (on-table b12)
    (clear b133)
    (on b133 b77)
    (on b77 b34)
    (on b34 b98)
    (on-table b98)
    (clear b112)
    (on b112 b118)
    (on-table b118)
    (clear b121)
    (on-table b121)
    (clear b1)
    (on b1 b129)
    (on b129 b96)
    (on-table b96)
    (clear b99)
    (on b99 b74)
    (on-table b74))
 (:goal  (and 
    (clear b4)
    (on b4 b3)
    (on b3 b2)
    (on b2 b1)
    (on-table b1))))

; plan
1. (unstack b1 b129)
   deleted: (on b1 b129) (clear b1) (arm-empty)
   added: (holding b1) (clear b129)
   goals met: 0 of 5
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 5
3. (unstack b134 b2)
   deleted: (on b134 b2) (clear b134) (arm-empty)
   added: (holding b134) (clear b2)
   goals met: 1 of 5
4. (putdown b134)
   deleted: (holding b134)
   added: (clear b134) (arm-empty) (on-table b134)
   goals met: 1 of 5
5. (unstack b79 b4)
   deleted: (on b79 b4) (clear b79) (arm-empty)
   added: (holding b79) (clear b4)
   goals met: 2 of 5
6. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 2 of 5
7. (unstack b93 b37)
   deleted: (on b93 b37) (clear b93) (arm-empty)
   added: (holding b93) (clear b37)
   goals met: 2 of 5
8. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 2 of 5
9. (unstack b37 b52)
   deleted: (on b37 b52) (clear b37) (arm-empty)
   added: (holding b37) (clear b52)
   goals met: 2 of 5
10. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 2 of 5
11. (unstack b52 b11)
   deleted: (on b52 b11) (clear b52) (arm-empty)
   added: (holding b52) (clear b11)
   goals met: 2 of 5
12. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 2 of 5
13. (unstack b11 b65)
   deleted: (on b11 b65) (clear b11) (arm-empty)
   added: (holding b11) (clear b65)
   goals met: 2 of 5
14. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 5
15. (unstack b65 b136)
   deleted: (on b65 b136) (clear b65) (arm-empty)
   added: (holding b65) (clear b136)
   goals met: 2 of 5
16. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 2 of 5
17. (unstack b136 b43)
   deleted: (on b136 b43) (clear b136) (arm-empty)
   added: (holding b136) (clear b43)
   goals met: 2 of 5
18. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 2 of 5
19. (unstack b43 b3)
   deleted: (on b43 b3) (clear b43) (arm-empty)
   added: (holding b43) (clear b3)
   goals met: 2 of 5
20. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 2 of 5
21. (unstack b2 b82)
   deleted: (on b2 b82) (clear b2) (arm-empty)
   added: (holding b2) (clear b82)
   goals met: 2 of 5
22. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 3 of 5
23. (unstack b3 b56)
   deleted: (on b3 b56) (clear b3) (arm-empty)
   added: (holding b3) (clear b56)
   goals met: 3 of 5
24. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 4 of 5
25. (unstack b4 b128)
   deleted: (on b4 b128) (clear b4) (arm-empty)
   added: (holding b4) (clear b128)
   goals met: 3 of 5
26. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 5 of 5
